---
kind: method
id: M:Autodesk.Revit.DB.PrintSetup.Revert
source: html/ddea247a-625d-18e9-660f-eee28615018c.htm
---
# Autodesk.Revit.DB.PrintSetup.Revert Method

Revert the current print setting.

## Syntax (C#)
```csharp
public void Revert()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the current print setting is In-Session.